In [1]:
#tools
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

#plotting
import seaborn as sns
import matplotlib.pyplot as plt

# models 
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [2]:
#read data from csv files
train = pd.read_csv('/Users/joy/Downloads/mp2/train.csv')
test = pd.read_csv('/Users/joy/Downloads/mp2/test.csv')
full=pd.concat([train,test], ignore_index=True)
y_train=train['Survived']

In [3]:
y_train.shape

(891,)

In [4]:
full.shape

(1309, 12)

In [5]:
full['Embarked']=full['Embarked'].dropna()

In [6]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
full.shape

(1309, 12)

In [8]:
print(train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

In [9]:
print(train.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [10]:
print(full.describe())

               Age         Fare        Parch  PassengerId       Pclass  \
count  1046.000000  1308.000000  1309.000000  1309.000000  1309.000000
mean     29.881138    33.295479     0.385027   655.000000     2.294882
std      14.413493    51.758668     0.865560   378.020061     0.837836
min       0.170000     0.000000     0.000000     1.000000     1.000000
25%      21.000000     7.895800     0.000000   328.000000     2.000000
50%      28.000000    14.454200     0.000000   655.000000     3.000000
75%      39.000000    31.275000     0.000000   982.000000     3.000000
max      80.000000   512.329200     9.000000  1309.000000     3.000000

             SibSp    Survived
count  1309.000000  891.000000
mean      0.498854    0.383838
std       1.041658    0.486592
min       0.000000    0.000000
25%       0.000000    0.000000
50%       0.000000    0.000000
75%       1.000000    1.000000
max       8.000000    1.000000

In [11]:
import matplotlib.pyplot as plt

In [12]:
train.shape

(891, 12)

In [13]:
a=full.isnull().sum()
print(a)

Age             263
Cabin          1014
Embarked          2
Fare              1
Name              0
Parch             0
PassengerId       0
Pclass            0
Sex               0
SibSp             0
Survived        418
Ticket            0
dtype: int64

In [14]:
b=test.isnull().sum()
print(b)

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [15]:
#make new column 'Title' 
full['Title']=full['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

In [16]:
pd.crosstab(full['Title'],full['Sex'])

Sex       female  male
Title
Capt           0     1
Col            0     4
Countess       1     0
Don            0     1
Dona           1     0
Dr             1     7
Jonkheer       0     1
Lady           1     0
Major          0     2
Master         0    61
Miss         260     0
Mlle           2     0
Mme            1     0
Mr             0   757
Mrs          197     0
Ms             2     0
Rev            0     8
Sir            0     1

In [17]:
#replace minority title
full['Title']=full['Title'].replace(['Capt','Col','Countess','Don','Dona','Jonkheer','Lady','Major','Rev','Sir'],'None')
full['Title']=full['Title'].replace('Mlle','Mrs')
full['Title']=full['Title'].replace(['Mme','Ms','Dona'],'Miss')
full['Title']=full['Title'].replace('Don','Mr')

In [18]:
pd.crosstab(full['Title'],full['Sex'])

Sex     female  male
Title
Dr           1     7
Master       0    61
Miss       263     0
Mr           0   757
Mrs        199     0
None         3    18

In [19]:
title_mapping = {'Mr': 1, 'Miss': 2, 'Mrs': 3, 'Master': 4, 'Dr':5, 'None': 6}
full['Title'] = full['Title'].map(title_mapping)

In [20]:
pd.crosstab(full['Title'],full['Sex'])

Sex    female  male
Title
1           0   757
2         263     0
3         199     0
4           0    61
5           1     7
6           3    18

In [21]:
full.shape

(1309, 13)

In [22]:
full=full.drop(['Name','Parch','SibSp'],axis=1)

In [23]:
full.shape

(1309, 10)

In [24]:
sex_mapping={'female':0, 'male':1}
full['Sex']=full['Sex'].map(sex_mapping)

In [25]:
pd.crosstab(full['Title'],full['Sex'])

Sex      0    1
Title
1        0  757
2      263    0
3      199    0
4        0   61
5        1    7
6        3   18

In [26]:
full[['Age','Title']].groupby(by='Title', as_index=False).mean().sort_values(by='Age', ascending=True)

   Title        Age
3      4   5.482642
1      2  21.814104
0      1  32.252151
2      3  36.843023
4      5  43.571429
5      6  45.714286

In [27]:
guess_age=full[['Title','Age']].dropna()
guess_age.shape

(1046, 2)

In [28]:
guess_age[['Age','Title']].groupby(by='Title', as_index=False).median().sort_values(by='Age', ascending=True)

   Title   Age
3      4   4.0
1      2  22.0
0      1  29.0
2      3  35.0
5      6  47.0
4      5  49.0

In [29]:
full['Age']=full.groupby('Title')['Age'].transform(lambda x: x.fillna(x.median()))

In [30]:
full['Fare']=full.groupby('Pclass')['Fare'].transform(lambda x: x.fillna(x.median()))

In [31]:
embarked_mapping={'S':1, 'C':2, 'Q':3}
full['Embarked']=full['Embarked'].map(embarked_mapping)
full['Embarked']=full.groupby('Pclass')['Embarked'].transform(lambda x: x.fillna(1))

In [32]:
full['AgeBand'] = pd.cut(full['Age'], 5)
full[['AgeBand', 'Survived']].groupby(['AgeBand'], as_index=False).mean().sort_values(by='AgeBand', ascending=True)

            AgeBand  Survived
0  (0.0902, 16.136]  0.548077
1  (16.136, 32.102]  0.327345
2  (32.102, 48.068]  0.439024
3  (48.068, 64.034]  0.428571
4    (64.034, 80.0]  0.090909

In [33]:
#full.loc[ full['Age'] <= 16, 'Age'] = 0
#full.loc[(full['Age'] > 16) & (full['Age'] <= 32), 'Age'] = 1
#full.loc[(full['Age'] > 32) & (full['Age'] <= 48), 'Age'] = 2
#full.loc[(full['Age'] > 48) & (full['Age'] <= 64), 'Age'] = 3
#full.loc[ full['Age'] > 64, 'Age']=4

In [34]:
a=full.isnull().sum()
print(a)

Age               0
Cabin          1014
Embarked          0
Fare              0
PassengerId       0
Pclass            0
Sex               0
Survived        418
Ticket            0
Title             0
AgeBand           0
dtype: int64

In [35]:
final=full.drop(['Cabin','PassengerId','Title','Ticket','Survived','AgeBand'],axis=1)

In [36]:
x_train=final.iloc[:891,:]
x_test=final.iloc[891:,:]

In [37]:
x_train.shape

(891, 5)

In [38]:
x_train.head()

    Age  Embarked     Fare  Pclass  Sex
0  22.0       1.0   7.2500       3    1
1  38.0       2.0  71.2833       1    0
2  26.0       1.0   7.9250       3    0
3  35.0       1.0  53.1000       1    0
4  35.0       1.0   8.0500       3    1

In [39]:
# Stochastic Gradient Descent

sgd = SGDClassifier()
sgd.fit(x_train, y_train)
Y_pred = sgd.predict(x_test)
acc_sgd = round(sgd.score(x_train, y_train) * 100, 2)
acc_sgd

31.43

In [40]:
# Decision Tree

decision_tree = DecisionTreeClassifier()
decision_tree.fit(x_train, y_train)
Y_pred = decision_tree.predict(x_test)
acc_decision_tree = round(decision_tree.score(x_train, y_train) * 100, 2)
acc_decision_tree

97.53

In [41]:
# Random Forest

random_forest = RandomForestClassifier(n_estimators=100)
random_forest.fit(x_train, y_train)
Y_pred = random_forest.predict(x_test)
random_forest.score(x_train, y_train)
acc_random_forest = round(random_forest.score(x_train, y_train) * 100, 2)
acc_random_forest

97.53

In [42]:
submission = pd.read_csv('/Users/joy/Downloads/mp2/sample_submission.csv')
submission.iloc[:,1] = np.floor(np.expm1(random_forest.predict(x_test)))